using System;
/*
Задача №2.

Напишите программу, в которой пользователь вводит имя и возраст. 
Программа отоббражает сообщение об имени и возрасте пользователя. 
Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 

*/

namespace Task_2._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
