using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
	Задние №5
	
	Напишите программу в которой пользователю предлагается ввести название дня недели. 
	По введенному названию программа определяет порядковый номер дня в неделе.
	Если пользователь вводит неправильное название дня, программа выводит сообщение о том, что такого дня нет.
	
	Предложите версию программы на основе вложенных условных оперторов и на основе оператора выбора switch.
*/
namespace Task_5
    {
    class Program
        {
        static void Main(string[] args)
            {
            }
        }
    }
