using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
	Задние №5
	
	Напишите программу, в которой создается массив и заполняется случайными числами.
	Массив отображается в консольном окне. В этом массиве необходимо определить элемент
	с минимальным значением. В частности, программа должна вывести значение элемента с минимальным
	значением и индекс этого элемента. Если элементов с минимальным  значением несколько, 
	должны быть выведены индексы всех этих элементов.
*/
namespace Task_5
    {
    class Program
        {
        static void Main(string[] args)
            {
            }
        }
    }
