using System;
/*
 * Задача №3.
 * 
Напишите программу, в которой пользователь последовательно вводит название текущего дня недели, 
название месяца и дату(номер в месяце). 
Программа выводит сообщение о сегодняшней дате(день недели, дата, месяц). 

Предложите консольную вресию программы.
 * 
 */

namespace Task_3._2
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
