using System;
/*
Задача №9.

Напишите программу, в которой пользователь вводит число,
а программой отображается последовательность из трех чисел: число, на единицу меньше введенного,
введенное число и число, на единицу больше введнного. 

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 

*/
namespace Task_9._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
