using System;
/*
Задача №8.

Напишите программу для вычисления суммы двух чисел. Оба числа вводятся пользователем. 
Для вычисления суммы используйте оператор +. 

Предложите консольную вресию программы.
*/

namespace Task_8._2
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
