using System;
/*
Задача №10.

Напишите программу, в которой пользователь вводит два числа,
а программой вычисляется и отображается сумма и разность этих чисел. 

Предложите консольную вресию программы.
*/
namespace Task_10._2
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
