using System;
/*
Задача №2.

Напишите программу, в которой пользователь вводит имя и возраст. 
Программа отоббражает сообщение об имени и возрасте пользователя. 

Предложите консольную вресию программы.

*/

namespace Task_2._2
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
