using System;
/*
Задача №10.

Напишите программу, в которой пользователь вводит два числа,
а программой вычисляется и отображается сумма и разность этих чисел. 

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 

*/
namespace Task_10._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
