using System;
/*
Задача №6.

Напишите программу, в которой пользователь вводит имя и год рождения, а программа отображает сообщение,
содержащее имя пользователя и его возраст. 

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 
*/


namespace Task_6._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
