using System;
/*
Задача №6.

Напишите программу, в которой пользователь вводит имя и год рождения, а программа отображает сообщение,
содержащее имя пользователя и его возраст. 

Предложите консольную вресию программы.
*/

namespace Task_6._2
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
