using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
	Задние №8
	
	Напишите программу, в которой создается двумерный целочисленный массив. 
	Он заполняется случайными числами. затем в этом массиве строки и столбцы меняются местами:
	первая строка становится первым столбцом, вторая строка становится вторым столбцом и так далее.
	Например, если исходный массив стоял из 3 строк и столбцов, 
	то в итоге получаем массив из 5 строк и 3 столбцов.
	
*/
namespace Task_8
    {
    class Program
        {
        static void Main(string[] args)
            {
            }
        }
    }
