using System;
/*
Задача №4.

Напишите программу, в которой пользователю предлагается ввести название месяца и количество дней в этом месяце. 
Программа выводит сообщение о том, что соответствующий месяц содержит указанное количество дней. 

Предложите версии для ввода/вывода данных через консоль.
*/
namespace Task_4._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
