using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
	Задние №2
	
	Напишите программу, в которой создается массив из 11 целочисленных элементов. 
	Массив заполняется степенями двойки - числами 2^0=1,2^1=2,2^2=4,2^3=8 и так далее до 2^10=1024.
	Призаполнении массива учесть, что начальный элемент равен 1, а каждый следющий больше
	предыдущего в 2 раза.  
	
	Отобразить массив в консольном окне в прямом и боратном порядке.
	Размер массива задается переменной.
*/
namespace Task_2
    {
    class Program
        {
        static void Main(string[] args)
            {
            }
        }
    }
