using System;
/*
Задача №8.

Напишите программу для вычисления суммы двух чисел. Оба числа вводятся пользователем. 
Для вычисления суммы используйте оператор +. 

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 

*/

namespace Task_8._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
