using System;
/*
 * Задача №3.
 * 
Напишите программу, в которой пользователь последовательно вводит название текущего дня недели, 
название месяца и дату(номер в месяце). 
Программа выводит сообщение о сегодняшней дате(день недели, дата, месяц). 

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 
 * 
 */
namespace Task_3._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
