using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*
	Задние №10
	
	Напишите программу, в которой вычисляется сумма чисел, удовлетворяющих таким критериям:
	при делении 5 в остатке получается 2, или при делении на 3 в остатке получается 1.
	Количество чисел в сумме вводится пользователем.
	Программа отображает числа, которые суммируются, и значение суммы.
	
	Предложите версии программы использующие разные операторы цикла.
 	Используйте обработку исключений.
*/
namespace Task_10
    {
    class Program
        {
        static void Main(string[] args)
            {
            }
        }
    }
