using System;
/*
Задача №7.

Напишите программу, в которой по возрасту опредялется год рождения. 
Возраст пользователь вводит в окно с полем, а вычисленный год рождения отображается в другом диалоговом окне.

Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 
*/
namespace Task_7._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
