using System;

/*
Задача №1.

Напишите программу, в котрой пользователь вводит сначала имя, а затем фамилию. 
Программа выводит сообщение с информацией об имени и фамилии пользователя. 
Предложите версию программы, в которой ввод и вывод текста осуществляется с помощью диалоговых окон. 
*/

namespace Task_1._1
    {
    class Program
        {
        static void Main(string[] args)
            {
            Console.WriteLine("Hello World!");
            }
        }
    }
